---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.DelayedConstraintForHandle
source: html/a0ff7c32-6b4c-eb98-a462-16bef0749a3b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.DelayedConstraintForHandle Property

The selected constraint targets do not satisfy a valid constraint. The rebar preview corresponds to latest valid rebar constraints.

## Syntax (C#)
```csharp
public static FailureDefinitionId DelayedConstraintForHandle { get; }
```